tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/cask-fonts"
tap "int128/kubelogin"
# Official Amazon AWS command-line interface
brew "awscli"
# New way of working with Protocol Buffers
brew "buf"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# Validate and define text-based and dynamic configuration
brew "cue"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Kubernetes package manager
brew "helm"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Postgres C API library
brew "libpq"
# Package manager for the Lua programming language
brew "luarocks"
# Run a Kubernetes cluster locally
brew "minikube"
# Deep clean and optimize your Mac
brew "mole"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# PostgreSQL syntax beautifier
brew "pgformatter"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@18"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Microsoft SQL Server command-line interface
brew "sqlcmd"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Incremental parsing library
brew "tree-sitter"
# Parser generator tool
brew "tree-sitter-cli"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Vault
brew "hashicorp/tap/vault"
# A kubectl plugin for Kubernetes OpenID Connect authentication
brew "int128/kubelogin/kubelogin"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
cask "ghostty"
cask "claude-code"
cask "codex"
cask "chatgpt"
cask "figma"
cask "1password"
cask "google-chrome"
cask "linear-linear"
cask "whatsapp"
cask "font-hack-nerd-font"
